2018/blockchain.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-03-07 周日 15:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>区块链的简单尝试</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">区块链的简单尝试</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb8e6a1f">1. 前言</a></li>
<li><a href="#orgd906dca">2. 代码尝试</a></li>
<li><a href="#orgf1b366d">3. 相关链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb8e6a1f" class="outline-2">
<h2 id="orgb8e6a1f"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
昨晚， 我再一次浏览了有关于区块链技术的博客。
</p>

<p>
然后， 我便惊喜的发现了这一篇博客： <a href="http://www.ruanyifeng.com/blog/2017/12/blockchain-tutorial.html?20180205184433">区块链入门教程</a>
</p>

<p>
之前看了很多博客， 但一直让我很捉急的便是， 对于实现部分， 对于为何会花那么多算力的部分， 讲解的不是很清楚。
</p>

<p>
我知道， <code>Hash</code> 算法耗费算力， 但我平时用 <code>Hash</code> 算法的时候， 花费的时间也不多啊 ！
</p>

<p>
在看了这篇博客之后， 突然明白， <code>Hash</code> 计算并不是只有一次， 而是由很多次计算得来的。
</p>

<p>
而 <code>难度系数</code> 影响了计算所需要的次数。
</p>

<p>
终于， 一个一直困惑我的部分得到了解答。
</p>

<p>
但是， 我还是想尝试一下， 具体怎么个耗时法。
</p>
</div>
</div>

<div id="outline-container-orgd906dca" class="outline-2">
<h2 id="orgd906dca"><span class="section-number-2">2</span> 代码尝试</h2>
<div class="outline-text-2" id="text-2">
<p>
得益于看到的博客， 我从相关链接中， 看到了一篇很简洁但很精辟的示例：
<a href="https://medium.freecodecamp.org/how-does-blockchain-really-work-i-built-an-app-to-show-you-6b70cd4caf7d">How does blockchain really work? I built an app to show you.</a>
</p>

<p>
这是一篇很好的文章， 模仿文中的代码， 我用 <code>Python</code> 写了一个小脚本来测试：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">-*- coding: utf-8 -*-</span>

<span class="org-keyword">from</span> __future__ <span class="org-keyword">import</span> print_function

<span class="org-keyword">import</span> time, random

<span class="org-keyword">from</span> hashlib <span class="org-keyword">import</span> sha256


<span class="org-keyword">class</span> <span class="org-type">BlockChain</span>(<span class="org-builtin">object</span>):
    <span class="org-doc">""" &#21306;&#22359;.</span>

<span class="org-doc">    :param index: &#24403;&#21069;&#21306;&#22359;&#30340; `index`.</span>
<span class="org-doc">    :type index: int</span>
<span class="org-doc">    :param pre_hash: &#21069;&#19968;&#20010;&#21306;&#22359;&#30340; `hash`.</span>
<span class="org-doc">    :type pre_hash: str</span>
<span class="org-doc">    :param data: &#24403;&#21069;&#21306;&#22359;&#35201;&#20648;&#23384;&#30340;&#20449;&#24687;.</span>
<span class="org-doc">    :type data: str</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, index, pre_hash, data):
        <span class="org-keyword">self</span>.index = index
        <span class="org-keyword">self</span>.pre_hash = pre_hash
        <span class="org-keyword">self</span>.time = time.ctime()
        <span class="org-keyword">self</span>.data = data
        <span class="org-keyword">self</span>.<span class="org-builtin">hash</span> = <span class="org-constant">None</span>
        <span class="org-keyword">self</span>.nonce = 0      <span class="org-comment-delimiter"># </span><span class="org-comment">&#35745;&#31639; `hash` &#30340;&#27425;&#25968;</span>

    <span class="org-keyword">def</span> <span class="org-function-name">calc_hash</span>(<span class="org-keyword">self</span>, difficulty):
        <span class="org-doc">""" &#35745;&#31639; `hash`.</span>

<span class="org-doc">        :pparam difficulty: &#35745;&#31639;&#38590;&#24230;.</span>
<span class="org-doc">        :type difficulty: int</span>
<span class="org-doc">        """</span>
        <span class="org-keyword">def</span> <span class="org-function-name">is_vaild_hash</span>(<span class="org-builtin">hash</span>, difficulty):
            <span class="org-doc">""" &#21028;&#26029;&#31639;&#30340;&#30340; `hash` &#26159;&#21542;&#26377;&#25928;.</span>
<span class="org-doc">            """</span>
            <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(<span class="org-builtin">len</span>(<span class="org-builtin">hash</span>)):
                <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-builtin">hash</span>[i] == <span class="org-string">'0'</span>:
                    <span class="org-keyword">break</span>
            <span class="org-keyword">return</span> i &gt;= difficulty

        <span class="org-builtin">input</span> = <span class="org-builtin">str</span>(<span class="org-keyword">self</span>.index) + <span class="org-keyword">self</span>.pre_hash + \
                <span class="org-keyword">self</span>.time + <span class="org-keyword">self</span>.data + <span class="org-builtin">str</span>(<span class="org-keyword">self</span>.nonce)
        <span class="org-keyword">self</span>.<span class="org-builtin">hash</span> = sha256(<span class="org-builtin">input</span>).hexdigest()

        <span class="org-keyword">while</span> <span class="org-keyword">not</span> is_vaild_hash(<span class="org-keyword">self</span>.<span class="org-builtin">hash</span>, difficulty):
            <span class="org-keyword">self</span>.nonce += 1
            <span class="org-builtin">input</span> = <span class="org-builtin">str</span>(<span class="org-keyword">self</span>.index) + <span class="org-keyword">self</span>.pre_hash + \
                    <span class="org-keyword">self</span>.time + <span class="org-keyword">self</span>.data + <span class="org-builtin">str</span>(<span class="org-keyword">self</span>.nonce)
            <span class="org-keyword">self</span>.<span class="org-builtin">hash</span> = sha256(<span class="org-builtin">input</span>).hexdigest()


<span class="org-keyword">def</span> <span class="org-function-name">genesis_block</span>():
    <span class="org-doc">""" &#33719;&#21462;&#21019;&#19990;&#21306;&#22359;.</span>
<span class="org-doc">    """</span>
    <span class="org-variable-name">first_block</span> = BlockChain(0, <span class="org-string">'0'</span>, <span class="org-string">'My first block'</span>)
    first_block.calc_hash(random.randint(1, 4))
    <span class="org-keyword">return</span> first_block


<span class="org-keyword">def</span> <span class="org-function-name">print_block</span>(block):
    <span class="org-doc">""" &#36755;&#20986;&#21306;&#22359;&#20449;&#24687;.</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">print</span>(<span class="org-string">'index: %s'</span> % block.index)
    <span class="org-keyword">print</span>(<span class="org-string">'hash: %s'</span> % block.<span class="org-builtin">hash</span>)
    <span class="org-keyword">print</span>(<span class="org-string">'nonce: %s\n'</span> % block.nonce)


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">'__main__'</span>:
    <span class="org-keyword">print</span>(<span class="org-string">'Genesis block:'</span>)
    <span class="org-variable-name">first_block</span> = genesis_block()
    print_block(first_block)

    <span class="org-variable-name">pre_block</span> = first_block

    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-variable-name">data</span> = <span class="org-builtin">raw_input</span>(<span class="org-string">'Input data: '</span>)
        <span class="org-keyword">if</span> data:
            <span class="org-variable-name">cur_block</span> = BlockChain(pre_block.index + 1, pre_block.<span class="org-builtin">hash</span>, data)

            <span class="org-variable-name">difficulty</span> = random.randint(1, 4)    <span class="org-comment-delimiter"># </span><span class="org-comment">..., &#38590;&#24230;&#31245;&#24494;&#22823;&#19968;&#28857;&#23621;&#28982;&#37117;&#35201;&#31639;&#21322;&#22825;...</span>
            <span class="org-keyword">print</span>(<span class="org-string">'difficulty: %s'</span> % difficulty)

            cur_block.calc_hash(difficulty)
            print_block(cur_block)

            <span class="org-variable-name">pre_block</span> = cur_block

        <span class="org-keyword">else</span>:
            <span class="org-keyword">break</span>

    <span class="org-keyword">print</span>(<span class="org-string">'over'</span>)
</pre>
</div>

<p>
代码比较粗糙， 但是并不妨碍我进行测试：
</p>
<pre class="example">
Genesis block:
index: 0
hash: 000a630deaf076650dc5ee90490ee1d16b3bc5a36ababcce68b807a32f16bfbd
nonce: 491

Input data: 第二个区块
difficulty: 3
index: 1
hash: 000da279af9350e82481bbcfbdec65ba47b5f79fbfb3439734cae69056bc8315
nonce: 6947

Input data: 难度是 ？
difficulty: 3
index: 2
hash: 000a4699eb0d5e74d15833c383a6c191a40fee89b804a792aa1ecbfecc3cf98a
nonce: 3725

Input data: 再一次测试
difficulty: 4
index: 3
hash: 0000f2d8aadd829dadb048d2624d155729d06b258dc7013ac31621ac515eb644
nonce: 37817

Input data: 再来一次
difficulty: 4
index: 4
hash: 00002863448497e9e4028d0875b7624d5172e952fc0ab128b336b20abe7df95e
nonce: 84479

Input data: github
difficulty: 4
index: 5
hash: 00001c6ce47f2e7d66f7a75a12f5de390a8456cfb734c3679af3750ee2917425
nonce: 53565
</pre>

<p>
这是测试过程， 当然不是最开始的。
</p>

<p>
最开始的时候， 难度系数生成的代码是： <code>random.randint(1, 24)</code>.
</p>

<p>
然后， 上来就是一个难度 7， 结果便是， 我去上了个厕所回来那一个区块还没出来&#x2026;&#x2026;
</p>

<p>
于是， 我默默的将代码改为了： <code>random.randint(1, 4)</code>.
</p>

<p>
但是， 这个计算次数还是让我很惊讶。轻轻松松上万。
</p>
</div>
</div>

<div id="outline-container-orgf1b366d" class="outline-2">
<h2 id="orgf1b366d"><span class="section-number-2">3</span> 相关链接</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://www.righto.com/2014/02/bitcoin-mining-hard-way-algorithms.html">Bitcoin mining the hard way: the algorithms, protocols, and bytes.</a></li>
<li><a href="https://medium.freecodecamp.org/how-does-blockchain-really-work-i-built-an-app-to-show-you-6b70cd4caf7d">How does blockchain really work? I built an app to show you.</a></li>
<li><a href="http://www.ruanyifeng.com/blog/2017/12/blockchain-tutorial.html?20180205184433">区块链入门教程</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<script src="https://utteranc.es/client.js"
        repo="rgb-24bit/blog"
        issue-term="pathname"
        theme="boxy-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
